In [1]:
import pandas as pd
segment_train=pd.read_csv(r"C:\Users\hp\Downloads\customer_segmentation\Train.csv")
segment_test=pd.read_csv(r"C:\Users\hp\Downloads\customer_segmentation\Test.csv")
segment_train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,NaN,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,NaN,High,6.0,Cat_6,A

In [2]:
segment_train.describe()

                  ID          Age  Work_Experience  Family_Size
count    8068.000000  8068.000000      7239.000000  7733.000000
mean   463479.214551    43.466906         2.641663     2.850123
std      2595.381232    16.711696         3.406763     1.531413
min    458982.000000    18.000000         0.000000     1.000000
25%    461240.750000    30.000000         0.000000     2.000000
50%    463472.500000    40.000000         1.000000     3.000000
75%    465744.250000    53.000000         4.000000     4.000000
max    467974.000000    89.000000        14.000000     9.000000

In [3]:
segment_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     7928 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        7990 non-null   object
 5   Profession       7944 non-null   object
 6   Work_Experience  7239 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      7733 non-null   float64
 9   Var_1            7992 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB

In [4]:
(segment_train.isnull().sum()/ len(segment_train))*100

ID                  0.000000
Gender              0.000000
Ever_Married        1.735250
Age                 0.000000
Graduated           0.966782
Profession          1.536936
Work_Experience    10.275161
Spending_Score      0.000000
Family_Size         4.152206
Var_1               0.941993
Segmentation        0.000000
dtype: float64

In [5]:
segment_train["Work_Experience"] = segment_train.groupby("Age")["Work_Experience"]\
    .transform(lambda x: x.fillna(x.median()))
segment_train["Work_Experience"]

0       1.0
1       1.0
2       1.0
3       0.0
4       1.0
       ...
8063    0.0
8064    3.0
8065    1.0
8066    1.0
8067    0.0
Name: Work_Experience, Length: 8068, dtype: float64

In [6]:
segment_train["Family_Size"].fillna(
    segment_train["Family_Size"].median(),
    inplace=True
)
segment_train["Family_Size"]

0       4.0
1       3.0
2       1.0
3       2.0
4       6.0
       ...
8063    7.0
8064    4.0
8065    1.0
8066    4.0
8067    3.0
Name: Family_Size, Length: 8068, dtype: float64

In [7]:
#segment_train = segment_train.drop(columns=["ID", "Segmentation"])
# droped id and segmentation; segmentation droped to do in unsupervised

In [8]:
cat_cols=segment_train.select_dtypes(include="object").columns
num_cols=segment_train.select_dtypes(exclude="object").columns
cat_cols, num_cols

(Index(['Gender', 'Ever_Married', 'Graduated', 'Profession', 'Spending_Score',
        'Var_1', 'Segmentation'],
       dtype='object'),
 Index(['ID', 'Age', 'Work_Experience', 'Family_Size'], dtype='object'))

In [9]:
#One-Hot Encoding 
segment_encoded = pd.get_dummies(
    segment_train,
    columns=cat_cols,
    drop_first=True
)

In [10]:
from sklearn.preprocessing import StandardScaler

scaler = StandardScaler()
segment_encoded[num_cols] = scaler.fit_transform(segment_encoded[num_cols])

In [12]:
segment_encoded.head()

,ID,Age,Work_Experience,Family_Size,Gender_Male,Ever_Married_Yes,Graduated_Yes,Profession_Doctor,Profession_Engineer,Profession_Entertainment,...,Spending_Score_Low,Var_1_Cat_2,Var_1_Cat_3,Var_1_Cat_4,Var_1_Cat_5,Var_1_Cat_6,Var_1_Cat_7,Segmentation_B,Segmentation_C,Segmentation_D
0,-0.258250,-1.284623,-0.454678,0.762698,1,0,0,0,0,0,...,1,0,0,1,0,0,0,0,0,1
1,-0.322213,-0.327151,-0.454678,0.095802,0,1,1,0,1,0,...,0,0,0,1,0,0,0,0,0,0
2,1.092695,1.408268,-0.454678,-1.237990,0,1,1,0,1,0,...,1,0,0,0,0,1,0,1,0,0
3,-0.672087,1.408268,-0.761088,-0.571094,1,1,1,0,0,0,...,0,0,0,0,0,1,0,1,0,0
4,-0.312195,-0.207467,-0.454678,2.096491,0,1,1,0,0,1,...,0,0,0,0,0,1,0,0,0,0

In [13]:
segment_train.head()

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,462809,Male,No,22,No,Healthcare,1.0,Low,4.0,Cat_4,D
1,462643,Female,Yes,38,Yes,Engineer,1.0,Average,3.0,Cat_4,A
2,466315,Female,Yes,67,Yes,Engineer,1.0,Low,1.0,Cat_6,B
3,461735,Male,Yes,67,Yes,Lawyer,0.0,High,2.0,Cat_6,B
4,462669,Female,Yes,40,Yes,Entertainment,1.0,High,6.0,Cat_6,A

In [ ]:
segment_encoded.remove